app/controllers/tfx_corporate_customers_controller.rb

SELECT `tfx_corporate_customers`.* FROM `tfx_corporate_customers`
---
  def index
    @tfx_corporate_customers = TfxCorporateCustomer.all

INSERT INTO `tfx_corporate_customers` (`C_LoginCode`, `C_CustomerChainID`, `C_CustomerName`, `Address1`, `Address2`, `City`, `State`, `Zip`, `Phone`, `created_at`, `updated_at`) VALUES ('Gen', 2, 'test', '1588 dorset drive', '', 'cordova', 'TN', '38118', '555-555-5555', '2016-02-26 04:45:04', '2016-02-26 04:45:04')
---
  def create
    @tfx_corporate_customer = TfxCorporateCustomer.new(tfx_corporate_customer_params)

    respond_to do |format|
      if @tfx_corporate_customer.save

SELECT  `tfx_corporate_customers`.* FROM `tfx_corporate_customers` WHERE `tfx_corporate_customers`.`id` = 1 LIMIT 1
---
    def set_tfx_corporate_customer
      @tfx_corporate_customer = TfxCorporateCustomer.find(params[:id])