app/controllers/tfx_contacts_controller.rb

  def index
    @tfx_contacts = TfxContact.all
---
SELECT `tfx_contacts`.* FROM `tfx_contacts`

  def create
    @tfx_contact = TfxContact.new(tfx_contact_params)

    respond_to do |format|
      if @tfx_contact.save
---
INSERT INTO `tfx_contacts` (`FirstName`, `LastName`, `Email`, `UserID`, `Password`, `Phone`, `Expires`, `created_at`, `updated_at`) VALUES ('dsadas', 'dsadas', '', '', '', '', '2016-02-26 04:59:00', '2016-02-26 05:00:01', '2016-02-26 05:00:01')

    def set_tfx_contact
      @tfx_contact = TfxContact.find(params[:id])
---
SELECT  `tfx_contacts`.* FROM `tfx_contacts` WHERE `tfx_contacts`.`id` = 1 LIMIT 1